# Задача 7. Да се напише програма, която да симулира 1000 завъртания на два зара (от 6
# числа). Програмата да съдържа два речника, единият да е с очакваните вероятности, а
# другият ще пази броят на числата, които са се паднали.


data = {
    2: 0,
    3: 0,
    4: 0,
    5: 0,
    6: 0,
    7: 0,
    8: 0,
    9: 0,
    10: 0,
    11: 0,
    12: 0
}
prob = {
    2: 2.78,
    3: 5.56,
    4: 8.33,
    5: 11.11,
    6: 13.89,
    7: 16.67,
    8: 13.89,
    9: 11.11,
    10: 8.33,
    11: 5.56,
    12: 2.78
}
import random

for sim in range(1000):
    dice_roll1 = random.randint(1, 6)
    dice_roll2 = random.randint(1, 6)
    dice_roll = dice_roll1 + dice_roll2
    data[dice_roll] += 1

for key, value in data.items():
    print(f"{key} {value} {prob[key]}")