# Задача 11. Карта Бинго се състои от 5 колони от 5 числа. Колоните са обозначени с
# буквите B, I, N, G и O. Има 15 числа, които могат да се появят под всяка буква. Поспециално, числата, които могат да се появят под B варират от 1 до 15, числата, които
# могат да се появят под I, варират от 16 до 30, числата, които могат да се появят под N
# диапазон от 31 до 45, и така нататък. Напишете програма, която създава произволна
# бинго карта и я съхранява в речник. Ключовете ще бъдат буквите B, I, N, G и O.
# Стойностите ще бъдат списъците на пет числа, които се появяват под всяка буква. Да се
# принтира картата Бинго заедно с колоните, обозначени по подходящ начин.
import random

card = {
    "B": [],
    "I": [],
    "N": [],
    "G": [],
    "O": [],
}
min = 1
max = 15
for letter in card:
    card[letter] = random.sample(range(min, max), 5)
    min += 15
    max += 15
print(card)
